////////////////////////////////////////////////////////////////////////////////


// 81_innerWidth , 81_value

/*

    window.innerWidth : 창의 컨텐츠 너비 (스크롤바 포함) (읽기전용)
    window.innerHeight : 창의 컨텐츠 높이 (스크롤바 포함) (읽기전용)
    
    window.outerWidth : 창 전체 너비 (도구모음 등) (읽기전용)
    window.outerHeight : 창 전체 높이 (도구모음 등) (읽기전용)

*/

/* 
    
    요소.value : input에 입력된 값 반환

    요소.value = 값 : input에 입력된 값 설정

*/

/* 

    요소.offsetWidth
    요소.offsetHeight : 패딩, 보더, 스크롤바 포함 너비 높이

    요소.clientWidth
    요소.clientHeight : 패딩 포함 너비 높이

    e.pageX : 현재 문서 기준 이벤트가 발생한 가로 위치 반환
    e.pageY : 현재 문서 기준 이벤트가 발생한 세로 위치 반환

*/


////////////////////////////////////////////////////////////////////////////////

// 86_scrollTop , 87_offsetTop

/* 

    document.documentElement : <html> 요소 반환
    document.body : <body> 요소 반환

    요소.scrollTop : 요소의 스크롤 양 반환
    요소.scrollLeft

    요소.offsetTop : 창 끝에서 요소의 y축 위치 반환
    요소.offsetLeft : 창 끝에서 요소의 x축 위치 반환



*/

////////////////////////////////////////////////////////////////////////////////

// 88_비디오 플레이어

/* 

    비디오요소.load() : 비디오 불러오기 (처음으로)

    비디오요소.play() : 비디오 재생

    비디오요소.pause() : 비디오 일시정지

*/

////////////////////////////////////////////////////////////////////////////////



////////////////////////////////////////////////////////////////////////////////



////////////////////////////////////////////////////////////////////////////////



////////////////////////////////////////////////////////////////////////////////